tutorials/surfaceTracking/bubbleInterTrackFoam/bubble2D_r0.75mm/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    space
    {
        type            inletOutlet;
        inletValue      uniform (0 -1e-6 0);
        value           uniform (0 -1e-6 0);
    }
    freeSurfaceShadow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    freeSurface
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
        value           uniform ( 0 0 0 );
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
